emacs/.config/emacs/config.org
#+Title: Satori's GNU Emacs Config
#+AUTHOR: Satori
#+DESCRIPTION: Satori's personal Emacs config.
#+STARTUP: content
#+OPTIONS: TOC:2

* Configuration
** Initial Setup
*** Source Scripts
#+begin_src emacs-lisp
(add-to-list 'load-path "~/.config/emacs/scripts/")
(require 'elpaca-setup)
(require 'buffer-move)
#+end_src
*** Config Functions
#+begin_src emacs-lisp
(defun disable-line-numbers ()
  (display-line-numbers-mode -1))

(defun disable-mode-line ()
  (setq mode-line-format nil))

(defun display-line-numbers-equalize ()
  "Equalize the width"
  (setq display-line-numbers-width (length (number-to-string (line-number-at-pos (point-max))))))
  #+end_src
*** Quiet Scratch Buffer
#+begin_src emacs-lisp
(setq initial-scratch-message "")
#+end_src
*** Misc
#+begin_src emacs-lisp
(recentf-mode 1)
#+end_src
** Visual Adjustments
*** Minimalde UI
#+begin_src emacs-lisp
(defun satori/visual/minimal-ui()
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1))
;(satori/visual/minimal-ui)
#+end_src
*** Plugins
** Org Mode
*** Plugins
**** Org Modern
#+begin_src emacs-lisp
(defun satori/org/init-org-modern()
  ; putting this setq here for now.
  (org-indent-mode -1)

  (use-package org-modern
    :hook
    (org-mode . org-modern-mode)
    (org-agenda-finalize . org-modern-agenda)))
(satori/org/init-org-modern)
#+end_src
**** Org Modern Indent
#+begin_src emacs-lisp
(defun satori/org/init-org-modern-indent()
  (use-package org-modern-indent 
    :elpaca (:host github :repo "jdtsmith/org-modern-indent")
    :config 
    (add-hook 'org-mode-hook #'org-modern-indent-mode 90)))
;(satori/org/init-org-modern-indent)
#+end_src
